Src/OpenFOAM/OpenFOAM-5.x-master/tutorials/combustion/fireFoam/LES/smallPoolFire3D/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh
runApplication topoSet
runApplication createPatch -overwrite

cp 0/ph_rgh.orig 0/ph_rgh

runApplication decomposePar -force

# Run
runParallel $application

#------------------------------------------------------------------------------
